In [6]:
#Dependencies 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
file = "Resources/car_insurance_claim.csv"
claim_data = pd.read_csv(file)
claim_data.head()

,ID,KIDSDRIV,BIRTH,AGE,HOMEKIDS,YOJ,INCOME,PARENT1,HOME_VAL,MSTATUS,...,CAR_TYPE,RED_CAR,OLDCLAIM,CLM_FREQ,REVOKED,MVR_PTS,CLM_AMT,CAR_AGE,CLAIM_FLAG,URBANICITY
0,63581743,0,16MAR39,60.0,0,11.0,"$67,349",No,$0,z_No,...,Minivan,yes,"$4,461",2,No,3,$0,18.0,0,Highly Urban/ Urban
1,132761049,0,21JAN56,43.0,0,11.0,"$91,449",No,"$257,252",z_No,...,Minivan,yes,$0,0,No,0,$0,1.0,0,Highly Urban/ Urban
2,921317019,0,18NOV51,48.0,0,11.0,"$52,881",No,$0,z_No,...,Van,yes,$0,0,No,2,$0,10.0,0,Highly Urban/ Urban
3,727598473,0,05MAR64,35.0,1,10.0,"$16,039",No,"$124,191",Yes,...,z_SUV,no,"$38,690",2,No,3,$0,10.0,0,Highly Urban/ Urban
4,450221861,0,05JUN48,51.0,0,14.0,NaN,No,"$306,251",Yes,...,Minivan,yes,$0,0,No,0,$0,6.0,0,Highly Urban/ Urban

In [8]:
# data shape 
#claim_data.dtypes
claim_data.shape

(10302, 27)

In [9]:
claim_data.count()

ID            10302
KIDSDRIV      10302
BIRTH         10302
AGE           10295
HOMEKIDS      10302
YOJ            9754
INCOME         9732
PARENT1       10302
HOME_VAL       9727
MSTATUS       10302
GENDER        10302
EDUCATION     10302
OCCUPATION     9637
TRAVTIME      10302
CAR_USE       10302
BLUEBOOK      10302
TIF           10302
CAR_TYPE      10302
RED_CAR       10302
OLDCLAIM      10302
CLM_FREQ      10302
REVOKED       10302
MVR_PTS       10302
CLM_AMT       10302
CAR_AGE        9663
CLAIM_FLAG    10302
URBANICITY    10302
dtype: int64

In [11]:
claim_data = claim_data.dropna(how='any')
claim_data.count()

ID            7657
KIDSDRIV      7657
BIRTH         7657
AGE           7657
HOMEKIDS      7657
YOJ           7657
INCOME        7657
PARENT1       7657
HOME_VAL      7657
MSTATUS       7657
GENDER        7657
EDUCATION     7657
OCCUPATION    7657
TRAVTIME      7657
CAR_USE       7657
BLUEBOOK      7657
TIF           7657
CAR_TYPE      7657
RED_CAR       7657
OLDCLAIM      7657
CLM_FREQ      7657
REVOKED       7657
MVR_PTS       7657
CLM_AMT       7657
CAR_AGE       7657
CLAIM_FLAG    7657
URBANICITY    7657
dtype: int64

In [31]:
#claim_data.info()

In [1]:
#claim_data.corr()

In [2]:
#plt.matshow(claim_data.corr())

In [15]:
#get rid of '$' & ',' for CLM_AMT, OLDCLAIM and INCOME and then convert the variable to numeric 

# CLM_AMT


#claim_data['CLM_AMT_CLEAN'] = 
claim_data['CLM_AMT'] = claim_data['CLM_AMT'].str.replace('$','').str.replace(',','')
#claim_data['CLM_AMT_CLEAN'] = 
#claim_data['CLM_AMT_CLEAN']


# OLDCLAIM


claim_data['OLDCLAIM'] = claim_data['OLDCLAIM'].str.replace('$','').str.replace(',','')
#claim_data['OLDCLAIM_CLEAN'] = claim_data['OLDCLAIM_CLEAN']


#INCOME
claim_data['INCOME'] = claim_data['INCOME'].str.replace('$','').str.replace(',','')
#claim_data['INCOME_CLEAN'] = claim_data['INCOME'].str.replace('$','')
#claim_data['INCOME_CLEAN'] = claim_data['INCOME_CLEAN'].str.replace(',','')

In [16]:
#convert to numeric 
claim_data['CLM_AMT'] = pd.to_numeric(claim_data['CLM_AMT'])
claim_data['OLDCLAIM'] = pd.to_numeric(claim_data['OLDCLAIM'])
claim_data['INCOME'] = pd.to_numeric(claim_data['INCOME'])

In [17]:
claim_data.head()

,ID,KIDSDRIV,BIRTH,AGE,HOMEKIDS,YOJ,INCOME,PARENT1,HOME_VAL,MSTATUS,...,CAR_TYPE,RED_CAR,OLDCLAIM,CLM_FREQ,REVOKED,MVR_PTS,CLM_AMT,CAR_AGE,CLAIM_FLAG,URBANICITY
0,63581743,0,16MAR39,60.0,0,11.0,67349,No,$0,z_No,...,Minivan,yes,4461,2,No,3,0,18.0,0,Highly Urban/ Urban
1,132761049,0,21JAN56,43.0,0,11.0,91449,No,"$257,252",z_No,...,Minivan,yes,0,0,No,0,0,1.0,0,Highly Urban/ Urban
2,921317019,0,18NOV51,48.0,0,11.0,52881,No,$0,z_No,...,Van,yes,0,0,No,2,0,10.0,0,Highly Urban/ Urban
3,727598473,0,05MAR64,35.0,1,10.0,16039,No,"$124,191",Yes,...,z_SUV,no,38690,2,No,3,0,10.0,0,Highly Urban/ Urban
6,871024631,0,05MAY65,34.0,1,12.0,125301,Yes,$0,z_No,...,Sports Car,no,0,0,No,0,2946,7.0,1,Highly Urban/ Urban

In [37]:
#dataframe 
#olumn_names = ["City", "Country"]
#cities_df = pd.DataFrame(columns=column_names)

In [38]:
claim_sum = claim_data.groupby('URBANICITY').CLM_AMT_CLEAN.sum()
claim_sum

URBANICITY
Highly Urban/ Urban      10712651
z_Highly Rural/ Rural      622851
Name: CLM_AMT_CLEAN, dtype: int64

In [40]:
#pie chart 
colors=("lightcoral","lightskyblue")
labels= ('Urban','Rural')
explode = (0,0.3)
plt.pie(claim_sum,colors=colors,explode= explode,labels=labels,autopct="%1.1f%%",shadow=False, startangle=20)
plt.axis("equal")
plt.title('% claims by city types')
plt.show()

In [17]:
claim_data.columns

Index(['ID', 'KIDSDRIV', 'BIRTH', 'AGE', 'HOMEKIDS', 'YOJ', 'INCOME',
       'PARENT1', 'HOME_VAL', 'MSTATUS', 'GENDER', 'EDUCATION', 'OCCUPATION',
       'TRAVTIME', 'CAR_USE', 'BLUEBOOK', 'TIF', 'CAR_TYPE', 'RED_CAR',
       'OLDCLAIM', 'CLM_FREQ', 'REVOKED', 'MVR_PTS', 'CLM_AMT', 'CAR_AGE',
       'CLAIM_FLAG', 'URBANICITY', 'CLM_AMT_CLEAN', 'OLDCLAIM_CLEAN',
       'INCOME_CLEAN'],
      dtype='object')

In [18]:
claim_data[['AGE']].head()

    AGE
0  60.0
1  43.0
2  48.0
3  35.0
6  34.0

In [19]:
#claim_data.columns

In [20]:
#claim_data.drop(columns=['BIRTH','REVOKED','BLUEBOOK','TIF','REVOKED','MVR_PTS', 'PARENT1',
                         #'HOME_VAL','RED_CAR','CLAIM_FLAG'], inplace=True)
#claim_data.head()

In [21]:
#claim_data.columns

In [22]:
#disply an overview of a column
#claim_data["MSTATUS"].value_counts()

In [23]:

#claim_data[['CLM_AMT_CLEAN2','CLM_AMT']].head()

In [ ]:
round()